export const roles = [
  { id: 1, name: "Администратор", login: "admin", password: "1" },
  { id: 2, name: "Преподаватель", login: "teacher", password: "1" },
  { id: 3, name: "Группа", login: "group", password: "1" },
  { id: 4, name: "Диспетчер", login: "dispatcher", password: "1" },
];

export const groups = [
  { id: 1, name: "20-ПИ", login: "group20", password: "1" },
  { id: 2, name: "21-ПИЦ", login: "group21", password: "1" },
  { id: 3, name: "23-ПИ", login: "group23", password: "1" },
  21-ПИЭ
  22-ПИЭ
22-ПИЦ


];

export const subgroups = [
  { id: 1, name: "23-ПИ-1", login: "subgroup1", password: "1" },
  { id: 2, name: "23-ПИ-3", login: "subgroup3", password: "1" },
  21-ПИЭ-1
21-ПИЭ-2
22-ПИЭ-1
22-ПИЭ-2
];

export const teachers = [
  { id: 1, name: "Копырин А.С.", login: "kas", password: "1" },
  { id: 2, name: "Коваленко В.В.", login: "kvv", password: "1" },
  { id: 3, name: "Драч В.Е.", login: "dve", password: "1" },
  { id: 4, name: "Салова Т.Л.", login: "stl", password: "1" },
  Улитина Е.И.
Кортава Ж.Г.
Легкая Е.Ф.
Федякина Л.К.
Волков А.Н.
Торкунов О.В.
Попов Д.И.
Таран К.В.
Федорова Н.Н.
Шуванова В.П.
Торкунова Ю.В.
Млынарь Е.Ш.
Прус Л.В.
];

export const Subjects = [
  { id: 1, name: "Алгоритмизация и программирование" },
  { id: 2, name: "Базы данных" },
  { id: 3, name: "Введение в машинное обучение" },
  { id: 4, name: "Комплексная автоматизация в корпоративных информационных системах" },
  { id: 5, name: "Экономика информационных систем" },
  { id: 6, name: "Экономико-математическое моделирование" },
  { id: 8, name: "Иностранный язык" },
  { id: 9, name: "Информационная безопасность" },
  { id: 10, name: "Информационные системы и технологии" },
  { id: 11, name: "Исследование операций и методы оптимизации" },
  { id: 12, name: "История России" },
  { id: 13, name: "Математика (продвинутый уровень)" },
  { id: 14, name: "Математическое и имитационное моделирование" },
  { id: 15, name: "Операционные системы" },
  { id: 16, name: "Основы фундаментального и технического анализа" },
  { id: 17, name: "Основы проектной деятельности" },
  { id: 18, name: "Основы военной подготовки" },
  { id: 20, name: "Правовые основы интеллектуальной собственности" },
  { id: 21, name: "Программирование и разработка веб-приложений" },
  { id: 22, name: "Проектный практикум" },
  { id: 24, name: "Психология" },
  { id: 25, name: "Реинжиниринг и управление бизнес-процессами" },
  { id: 26, name: "Речевая коммуникация и деловое общение" },
  { id: 27, name: "Современный инструментарий бизнес-аналитики" },
  { id: 28, name: "Элективные дисциплины по физической культуре и спорту" },
];
